---
kind: property
id: P:Autodesk.Revit.DB.MEPSize.NominalDiameter
source: html/a77fe63e-1247-6dab-8fd2-f73f331a0f3e.htm
---
# Autodesk.Revit.DB.MEPSize.NominalDiameter Property

Nominal diameter

## Syntax (C#)
```csharp
public double NominalDiameter { get; }
```